; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v3 ?v8)
             (pred_11 ?v6 ?v13)
             (pred_7 ?v3 ?v13)
             (pred_4 ?v4 ?v3 )
	     (pred_1 ?v3)
             (pred_6 ?v12)
             (pred_12 ?v6)
             (pred_2 ?v13)
             (pred_3 ?v3)
             (pred_8 ?v6)
             (pred_9 ?v3)
             (pred_10 ))



(:action op_4
:parameters (?v2 ?v10 ?v1 ?v7)
:precondition (and (pred_6 ?v2) (pred_6 ?v10) (pred_12 ?v1) (pred_2 ?v7)
          (pred_5 ?v2 ?v10) (pred_11 ?v1 ?v7)
                   (pred_7 ?v10 ?v7) (pred_1 ?v2) 
                   (pred_3 ?v10) (pred_8 ?v1))
:effect (and  (pred_9 ?v10) (not (pred_3 ?v10))))


(:action op_1
:parameters (?v2 ?v11)
:precondition (and (pred_6 ?v2) (pred_6 ?v11)
               (pred_1 ?v2) (pred_5 ?v2 ?v11) (pred_9 ?v11))
:effect (and (pred_1 ?v11) (not (pred_1 ?v2))))

(:action op_3
:parameters (?v2 ?v1)
:precondition (and (pred_6 ?v2) (pred_12 ?v1) 
                  (pred_1 ?v2) (pred_4 ?v1 ?v2) (pred_10 ))
:effect (and (pred_8 ?v1)
   (not (pred_4 ?v1 ?v2)) (not (pred_10 ))))


(:action op_5
:parameters (?v2 ?v5 ?v9)
:precondition (and (pred_6 ?v2) (pred_12 ?v5) (pred_12 ?v9)
                  (pred_1 ?v2) (pred_8 ?v9) (pred_4 ?v5 ?v2))
:effect (and (pred_8 ?v5) (pred_4 ?v9 ?v2)
        (not (pred_8 ?v9)) (not (pred_4 ?v5 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_6 ?v2) (pred_12 ?v1) 
                  (pred_1 ?v2) (pred_8 ?v1))
:effect (and (pred_10 ) (pred_4 ?v1 ?v2) (not (pred_8 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_28 obj_23 obj_01 obj_17 obj_24 obj_04 obj_21 obj_06 obj_03 obj_02 obj_13 obj_05 obj_11 obj_20 obj_12 obj_32 obj_29 obj_22 obj_25 obj_18 obj_15 obj_14 obj_09 obj_26 obj_07
    obj_27 obj_31 obj_16
    obj_19 obj_30 obj_10 obj_08
    )

    (:init
       (pred_10)

       (pred_6 obj_28)
       (pred_6 obj_23)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_6 obj_24)
       (pred_6 obj_04)
       (pred_6 obj_21)
       (pred_6 obj_06)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_12)
       (pred_6 obj_32)
       (pred_6 obj_29)
       (pred_6 obj_22)
       (pred_6 obj_25)
       (pred_6 obj_18)
       (pred_6 obj_15)
       (pred_6 obj_14)
       (pred_6 obj_09)
       (pred_6 obj_26)
       (pred_6 obj_07)
       (pred_2 obj_27)
       (pred_2 obj_31)
       (pred_2 obj_16)
       (pred_12 obj_19)
       (pred_12 obj_30)
       (pred_12 obj_10)
       (pred_12 obj_08)

       (pred_5 obj_28 obj_04)
       (pred_5 obj_28 obj_23)
       (pred_5 obj_23 obj_21)
       (pred_5 obj_23 obj_01)
       (pred_5 obj_23 obj_28)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_17)
       (pred_5 obj_01 obj_23)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_17 obj_24)
       (pred_5 obj_17 obj_01)
       (pred_5 obj_24 obj_02)
       (pred_5 obj_24 obj_17)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_21)
       (pred_5 obj_04 obj_28)
       (pred_5 obj_21 obj_05)
       (pred_5 obj_21 obj_06)
       (pred_5 obj_21 obj_23)
       (pred_5 obj_21 obj_04)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_06 obj_21)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_24)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_13 obj_32)
       (pred_5 obj_13 obj_05)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_05 obj_29)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_21)
       (pred_5 obj_05 obj_13)
       (pred_5 obj_11 obj_22)
       (pred_5 obj_11 obj_20)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_20 obj_25)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_20 obj_11)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_32 obj_15)
       (pred_5 obj_32 obj_29)
       (pred_5 obj_32 obj_13)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_29 obj_22)
       (pred_5 obj_29 obj_05)
       (pred_5 obj_29 obj_32)
       (pred_5 obj_22 obj_09)
       (pred_5 obj_22 obj_25)
       (pred_5 obj_22 obj_11)
       (pred_5 obj_22 obj_29)
       (pred_5 obj_25 obj_26)
       (pred_5 obj_25 obj_18)
       (pred_5 obj_25 obj_20)
       (pred_5 obj_25 obj_22)
       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_25)
       (pred_5 obj_15 obj_14)
       (pred_5 obj_15 obj_32)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_14 obj_15)
       (pred_5 obj_09 obj_26)
       (pred_5 obj_09 obj_22)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_26 obj_07)
       (pred_5 obj_26 obj_25)
       (pred_5 obj_26 obj_09)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_26)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_29)
       (pred_3 obj_11)
       (pred_7  obj_02 obj_27)
       (pred_7  obj_18 obj_31)
       (pred_7  obj_29 obj_16)
       (pred_7  obj_11 obj_16)
       (pred_9 obj_28)
       (pred_9 obj_23)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_24)
       (pred_9 obj_04)
       (pred_9 obj_21)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_32)
       (pred_9 obj_22)
       (pred_9 obj_25)
       (pred_9 obj_15)
       (pred_9 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_26)
       (pred_9 obj_07)

       (pred_11  obj_19 obj_27)
       (pred_11  obj_30 obj_31)
       (pred_11  obj_10 obj_16)
       (pred_11  obj_08 obj_16)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_30 obj_24)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_08 obj_25)
       (pred_1 obj_25)
    )

    (:goal (and
       (pred_4 obj_08 obj_01)
    ))
(:constraints
  (always (not (pred_1 obj_20)))
)
)

; plan
1. (op_3 obj_25 obj_08)
   deleted: (pred_4 obj_08 obj_25) (pred_10)
   added: (pred_8 obj_08)
   goals met: 0 of 1
2. (op_1 obj_25 obj_22)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_22)
   goals met: 0 of 1
3. (op_4 obj_22 obj_11 obj_08 obj_16)
   deleted: (pred_3 obj_11)
   added: (pred_9 obj_11)
   goals met: 0 of 1
4. (op_1 obj_22 obj_11)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_11)
   goals met: 0 of 1
5. (op_1 obj_11 obj_06)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_06)
   goals met: 0 of 1
6. (op_1 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 0 of 1
7. (op_2 obj_01 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_10) (pred_4 obj_08 obj_01)
   goals met: 1 of 1
